Repository: mishin/perldoc-ru
Catalog: pod2-ru/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: If B<t> is specified, it indicates to the debugger that threads will be used in the code being debugged.
ru_ru: Если B<t> указан, то он указывает, что отладчик темы будет использоваться в коде отладки.

source: If I<4DOS> were the command shell, this would probably work better:
ru_ru: Если в I<4DOS> была командная оболочка, это, вероятно работает лучше:

source: If I<octnum> is omitted, sets C<$\> to the current value of C<$/>.
ru_ru: Если I<octnum>> опущен, устанавливает C<$\>; для текущего значения как C<$/>.

source: If PERL5LIB is defined, PERLLIB is not used.
ru_ru: Если PERL5LIB определено, PERLLIB не используется.

source: If PERL5LIB is not defined, PERLLIB is used.
ru_ru: Если PERL5LIB не определена, PERLLIB используется.

source: If PERL5OPT begins with B<-T>, tainting will be enabled and subsequent options ignored.
ru_ru: Если PERL5OPT начинается с B<-T>, заражение(tainting) будет включена и последующие варианты игнорируются.

source: If a directory name is specified, Perl will switch to that directory before running the program.
ru_ru: Если имя каталога указано, Perl будет переключаться в этот каталог перед запуском программы.

source: If a file named by an argument cannot be opened for some reason, Perl warns you about it and moves on to the next file.
ru_ru: Если файл, названный в аргументе не может быть открыт по некоторым причинам, Perl предупреждает вас об этом и переходит к следующему файлу.

source: If a file named by an argument cannot be opened for some reason, Perl warns you about it, and moves on to the next file.
ru_ru: Если файл, указанный в аргументе не может быть открыт по некоторым причинам, Perl предупреждает вас об этом, и переходит к следующему файлу.

source: If a2p makes a split line that assigns to a list of variables that looks like (Fld1, Fld2, Fld3...) you may want to rerun a2p using the B<-n> option mentioned above.
ru_ru: Если a2p делает разбор строки, которая представляет собой список переменных, который выглядит как (Fld1, Fld2, Fld3...) вы можете повторно запустить a2p используя опцию B<-n> , упомянутую выше.

source: If it cannot relinquish its privileges, it will not run.
ru_ru: Если смена прав не удалась, то программа не запускается.

source: If it splits to an array instead, the script is probably referring to the number of fields somewhere.
ru_ru: Вместо этого он разбивает на массив, вероятно, ссылаясь на число полей где-нибудь.

source: If no extension is supplied, and your system supports it, the original I<file> is kept open without a name while the output is redirected to a new file with the original I<filename>.
ru_ru: Если расширение не указано, и ваша система поддерживает его, оригинальный I<файл> остается открытым без имени в то время как вывод будет перенаправлен в новый файл с оригинальным I<именем> .

source: If perl is built to use PerlIO system for IO (the default) these layers affect Perl's IO.
ru_ru: Если Perl построен использовать PerlIO как систему ввода-вывода (по умолчанию) эти слои влияют на IO Perl.

source: If set to C<safe>, then safe (but deferred) signals are used.
ru_ru: Если установлено значение C<safe> , То безопасным (но отложенные) сигналы.

source: If set to an integer greater than one, also dumps out memory statistics after compilation.
ru_ru: Если установлено значение целое число больше единицы, также выводит из статистики использования памяти после компиляции.

source: If set to C<"unsafe">, the pre-Perl-5.8.0 signal behaviour (which is immediate but unsafe) is restored.
ru_ru: Если установлено значение C<"unsafe">, предварительно Perl-5.8.0 Поведение сигнала (который является непосредственным, но небезопасно) восстанавливается.

source: If set to a true value, indicates to the debugger that the code being debugged uses threads.
ru_ru: Если установлена ​​в истинное значение, указывает, что отладчик кода отлаживаемой использует потоки.

source: If set to the name of a file or device, certain operations of PerlIO subsystem will be logged to that file, which is opened in append mode.
ru_ru: Если установлено имя файла или устройства, определенные операции PerlIO подсистемы будут записываться в этот файл, который открывается в режиме добавления.

source: If set, this dumps out memory statistics after execution.
ru_ru: Если установлено, дамп памяти статистику после выполнения.

source: If somehow you are relying on this mechanism to create null entries for a subsequent for...in, they won't be there in perl.
ru_ru: Если каким-то образом вы полагаетесь на этот механизм для создания пустых записей для последующего для ..., их там не будет в Perl.

source: If the C<#!> line does not contain the word "perl" nor the word "indir" the program named after the C<#!> is executed instead of the Perl interpreter.
ru_ru: Если строка C<#!> не содержит слово "perl", ни слово "indir" программа, написанная послеC<#!> будет выполняться вместо интерпретатора Perl.

source: If the C<POD2::E<lt>language_codeE<gt>> package isn't installed in your system, the switch is ignored.
ru_ru: Если C<POD2::E<lt>код_языка<gt>> не существует (или не установлен на вашей системе), то параметр игнорируется.

source: If the extension does contain one or more C<*> characters, then each C<*> is replaced with the current filename.
ru_ru: Если расширение содержит один или более символов C<*>, то каждый C<*> заменяется с текущим именем файла.

source: If the extension doesn't contain a C<*>, then it is appended to the end of the current filename as a suffix.
ru_ru: Если расширение не содержит C<*>, то оно добавляется к концу текущего файла в качестве суффикса.

source: If the filename supplied contains directory separators (and so is an absolute or relative pathname), and if that file is not found, platforms that append file extensions will do so and try to look for the file with those extensions added, one by one.
ru_ru: Если имя файла содержит разделители директорий (и поэтому абсолютный или относительный путь), и, если этот файл не найден, платформа, которая добавляют расширения файлов сделает это и попытается искать файл с этими добавленным расширениями, один за другим.

source: If the first character after the B<-M> or B<-m> is a dash (B<->) then the 'use' is replaced with 'no'.
ru_ru: Если первый символ после B<-M> или B<-m> является тире (B<->), то «использование» заменяется на «нет».

source: If the option is provided, and C<PERL_PERTURB_KEYS> is NOT set, then a value of '0' implies C<PERL_PERTURB_KEYS=0> and any other value implies C<PERL_PERTURB_KEYS=2>.
ru_ru: Если опция предусмотрена, и C<PERL_PERTURB_KEYS> не установлен, то значение '0 'означает C<PERL_PERTURB_KEYS=0> и любое другое значение означает C<PERL_PERTURB_KEYS=2> .

source: If the program runs off the end without hitting an exit() or die() operator, an implicit C<exit(0)> is provided to indicate successful completion.
ru_ru: Если программа работает до конца, не вызвая операторы exit() или die(), неявный C<exit(0)> предусмотрен для указания успешного завершения.

source: If the program is syntactically correct, it is executed.
ru_ru: Если программа синтаксически правильна, она выполняется.

source: If the program will be interpreted by csh, you will need to replace C<${1+"$@"}> with C<$*>, even though that doesn't understand embedded spaces (and such) in the argument list.
ru_ru: Если программа будет интерпретирован csh, вы, нужно будет заменить C<${1+"$@"}> на C<$*>, хотя это не понимает пробелы (и такой) в списке аргументов .

source: If there are any compilation errors, execution of the program is not attempted.
ru_ru: Если есть какие-либо ошибки компиляции, программы не пытается выполниться.

source: If there are no digits, the null character is the separator.
ru_ru: Если нет никаких цифр, нулевой символ является разделителем.

source: If using the C<use encoding> pragma without an explicit encoding name, the PERL_ENCODING environment variable is consulted for an encoding name.
ru_ru: При использовании C<use encoding> Pragma без явного именем кодировки, PERL_ENCODING переменная окружения консультировал имя кодировки.

source: If you are looking for a table of contents to the Perl library modules documentation, see the L<perltoc> page.
ru_ru: Если вы ищете оглавление к библиотеке документаций модулей Perl, смотрите L<perltoc>.

source: If you feel the urge to write Perl modules, L<perlnewmod> will give you good advice.
ru_ru: Если вы чувствуете желание писать модули на Perl, L<perlnewmod> даст вам хороший совет.

source: If you install Perl by other means (including building from the sources), you may have to modify the Registry yourself.
ru_ru: Если вы установили Perl с помощью других средств (в том числе билд из источников), возможно, придется внести изменения в реестр самостоятельно.

source: If you want a specific version of Perl, say, perl5.14.1, you should place that directly in the C<#!> line's path.
ru_ru: Если вы хотите конкретной версии Perl, скажем, perl5.14.1, вы должны поместить это прямо в путь на строке C<#!>.

source: If you want runtime effects, use the three-arg open() (see L<perlfunc/open>), the two-arg binmode() (see L<perlfunc/binmode>), and the C<open> pragma (see L<open>).
ru_ru: Если вы хотите эффекта во время выполнения (runtime effects), используйте трёхаргументный open() (see L<perlfunc/open>), двухаргументный binmode () (см. L<perlfunc/binmode> ) И прагму (pragma) C<open> (см. L<open>).

source: If you want to learn the basics of Perl, you might start with the Llama book, which assumes that you already know a little about programming:
ru_ru: Если вы хотите научиться основам Perl, вы можете начать с книги Лама, который предполагает, что вы уже кое-что знаете о программировании:

source: If you were translating an awk script that processes the password file, you might say:
ru_ru: Если вы переводите сценарий AWK, который обрабатывает файл пароля, вы можете сказать:

source: If you're just trying to get a print out of each line of Perl code as it executes, the way that C<sh -x> provides for shell scripts, you can't use Perl's B<-D> switch.
ru_ru: Если вы просто пытаются получить печать из каждой строки кода Perl, как он выполняет, таким образом, что C<sh -x> предоставляет для shell скриптов, вы не можете использовать Perl-вый B<-D> ключ.

source: If you're new to Perl, you should start by running C<perldoc perlintro>, which is a general intro for beginners and provides some background to help you navigate the rest of Perl's extensive documentation.
ru_ru: Если вы новичок в Perl, вы должны начать, запустив C<perldoc perlintro>, которая представляет собой общее введение для новичков и дает некоторые базовые навыки, чтобы помочь вам ориентироваться в остальной обширной документации Perl.

source: If you've succeeded in compiling perl, the L<perlbug> script in the F<utils/> subdirectory can be used to help mail in a bug report.
ru_ru: Если вы преуспели в компиляции perl, the L<perlbug> сценарий в F<utils/> подкаталоге может быть использован, чтобы помочь для написания письма с отчетом об ошибке.

source: If your Perl book isn't listed and you think it should be, let us know.
ru_ru: Если ваш Perl книги нет в списке, и вы думаете, она должна быть, дайте нам знать.

source: If your Perl success stories and testimonials may be of help to others who wish to advocate the use of Perl in their applications, or if you wish to simply express your gratitude to Larry and the Perl developers, please write to perl-thanks@perl.org .
ru_ru: Если ваша Perl история успеха и отзывы могут быть полезны тем, кто стремиться к поддержке использования Perl в своих приложениях, или если вы хотите просто выразить свою благодарность Ларри и Perl разработчикам, пожалуйста, напишите perl-thanks@perl.org .

source: If your Perl was compiled with C<DEBUGGING> turned on, using the B<-Dp> switch to Perl shows how the search progresses.
ru_ru: Если ваш Perl был скомпилирован с включенной опцией C<DEBUGGING>, используя опцию B<-Dp> Perl покажет как продвигается поиск.

source: If your Perl was configured with B<-Accflags=-DPERL_MEM_LOG>, setting the environment variable C<PERL_MEM_LOG> enables logging debug messages.
ru_ru: Если ваш Perl был настроен с B<-Accflags=-DPERL_MEM_LOG>, задав переменную окружения C<PERL_MEM_LOG> позволяет записывать в журнал отладочных сообщений.

source: If your stdio requires a seek or eof between reads and writes on a particular stream, so does Perl.
ru_ru: Если ваш stdio требует искать eof(символ конца файла) между чтением и записью соответствующего потока, то это делает Perl.

source: If, for a given file, Perl is unable to create the backup file as specified in the extension then it will skip that file and continue on with the next one (if it exists).
ru_ru: Если для данного файла, Perl не может создать файл резервной копии, как указано в расширении, то он пропустит этот файл и продолжить работу со следующей задачей (если она существует).

source: Ignore case.
ru_ru: Игнорировать регистр.

source: In scalar context it reads a single line from the filehandle, and in list context it reads the whole file in, assigning each line to an element of the list:
ru_ru: В скалярном контексте он читает одну строку из дескриптора файла, а в списочном контексте он читает весь файл в, назначая каждую строку элементу списка:

source: In Perl terms, you could think of this as:
ru_ru: В Perl терминах, вы можете думать об этом как:

source: In addition, any directories matching the entries in C<$Config{inc_version_list}> are added.
ru_ru: Кроме того, любые каталоги, соответствующие записи в C<$Config{inc_version_list}> будут добавлены.

source: In directories where either C<Makefile.PL> or C<Build.PL> exist, C<perldoc> will add C<.> and C<lib> first to its search path, and as long as you're not the superuser will add C<blib> too.
ru_ru: В каталогах, где есть либо C<Makefile.PL> либо C<Build.PL>, C<perldoc> добавляет C<.> и C<lib> первым его пути поиска, и до тех пор, пока суперпользователь не добавит C<blib> тоже.

source: In fact, you can match on just about anything you could dream of by using more complex regular expressions.
ru_ru: В самом деле, вы можете сопоставить все что угодно, о чем вы могли бы мечтать, используя более сложные регулярные выражения.

source: In general though, we try to limit this list to books published in the past five years.
ru_ru: Но в общем, мы стараемся ограничить этот список книг, изданных в последние пять лет.

source: In general, if something strange has gone wrong with your program and you're not sure where you should look for help, try making your code comply with B<use strict> and B<use warnings>.
ru_ru: В общем, если что-то странное пошло не так с вашей программой, и вы не уверены, где вы должны искать помощи, попробуйте поставить в начале программы B<use strict> и B<use warnings>.

source: In old awk, sprintf is extremely greedy about its arguments.
ru_ru: В старых awk sprintf является очень жадным в своих аргументав.

source: In order to make it more robust it is recommended to start every program with the following lines:
ru_ru: Для того, чтобы сделать его более надежным, рекомендуется начинать каждый программу со следующих строк:

source: In other words, the standard I/O handles and the default C<open()> layer are UTF-8-fied I<but> only if the locale environment variables indicate a UTF-8 locale.
ru_ru: Другими словами, стандарт ввода/вывода управляет умолчанием C<open()> слоя и будет переведет в UTF-8 I<но> только если переменные окружения указывают на локаль(locale) UTF-8.

source: In particular, both CRLF translation and intuiting C<:utf8> from the locale are disabled.
ru_ru: В частности, оба CRLF перевода и созерцание C<:utf8> из локали отключены.

source: In some cases perfection has been sacrificed in the goal of getting the general idea across.
ru_ru: В некоторых случаях совершенство изложения было принесено в жертву общей идее.

source: In the example pragma, retrieval is encapsulated into the routine C<in_effect()>, which takes as parameter the number of call frames to go up to find the value of the pragma in the user's script.
ru_ru: В прагме из примера восстановление инкапсулировано в подпрограмме C<in_effect()>, которая в качестве аргументов принимает единственный параметр - число вызовов, оставшихся для нахождения значения прагмы в пользовательском скрипте.

source: In this case, no backup is made (the original file cannot, of course, be determined) and processing proceeds from STDIN to STDOUT as might be expected.
ru_ru: В этом случае резервная копия не делается (исходный файл не может, конечно, быть определен), и обработка переходит со стандартного ввода (STDIN) на стандартный вывод (STDOUT), как можно было ожидать.

source: In this documentation, C<#!/usr/bin/perl> on the first line of the program will stand in for whatever method works on your system.
ru_ru: В этой документации, C<#!/usr/bin/perl> на первой строке программы будет стоять какой бы метод не работал в вашей системе.

source: Insertion into a hash will not change the order, except to provide for more space in the hash.
ru_ru: Установка в хэш не изменит порядка, кроме как для оказания за больше места в хэш.

source: Instead do this
ru_ru: Вместо того, чтобы сделать это

source: Instead it guesses which one you want.
ru_ru: Вместо этого он предлагает то, что вы хотите.

source: Isn't this a bug in Perl?>.
ru_ru: Разве это не ошибка в Perl?>.

source: It handles all kinds of structured text, too, through an extensive collection of extensions.
ru_ru: Он обрабатывает все виды структурированного текста, также, через обширную коллекцию расширений.

source: It is intended as a "bootstrap" guide for those who are new to the language, and provides just enough information for you to be able to read other peoples' Perl and understand roughly what it's doing, or write your own simple scripts.
ru_ru: Он задуман как "начальная загрузка" (bootstrap) руководство для тех, кто плохо знаком с языком, а также предоставляет достаточно информации для вас, чтобы иметь возможность читать Perl код других людей и понять, примерно то, что он делает, или написать собственный простой сценарий.

source: It can be useful but it may be a memory hog.
ru_ru: Это может быть полезным, но это может иметь память свиньи.

source: It can for instance be used to add entries to the @INC array to make Perl find modules in non-standard locations.
ru_ru: Он может, например, использоваться для добавления записей в массив @INC, чтобы найти Perl модули в нестандартных местах.

source: It combines (in the author's opinion, anyway) some of the best features of B<sed>, B<awk>, and B<sh>, making it familiar and easy to use for Unix users to whip up quick solutions to annoying problems.
ru_ru: Он сочетает в себе (по мнению автора, во всяком случае) некоторые из лучших особенностей B<sed>, B<awk>, и B<sh>, что делает его знакомым и простым, быстрым и удобным для пользователей Unix при решении досадных проблем.

source: It does not even aim to be entirely accurate.
ru_ru: Он даже не стремятся быть совсем точным.

source: It does suffer from the bug of mishandling newlines in pathnames, which you can fix if you follow the example under B<-0>.
ru_ru: Он страдает от неправильного обращения ошибка в строки символ новой строки в путях (pathnames), которые можно исправить, если вы будете следовать, например, под B<-0>.

source: It does this by renaming the input file, opening the output file by the original name, and selecting that output file as the default for print() statements.
ru_ru: Он делает это путем переименования входного файла, открытия выходного файла по оригинальному названию, и выбора, что выходной файл является файлом по умолчанию для оператора print().

source: It does, however, use ARGVOUT for the selected filehandle.
ru_ru: Это, однако, использует ARGVOUT для выбранного дескриптор файла.

source: It has two separate effects.
ru_ru: Она состоит из двух отдельных эффектов.

source: It is conventional to start layer names with a colon (for example, C<:perlio>) to emphasize their similarity to variable "attributes".
ru_ru: Принято, чтобы начать имена слоев с двоеточия (например, C<:perlio>), чтобы подчеркнуть их сходство с переменной "атрибуты".

source: It is recommended that you explicitly set (or delete) C<$ENV{PERL5SHELL}> when running in taint mode under Windows.
ru_ru: Рекомендуется, чтобы вы явно установить (или удалить) C<$ENV{PERL5SHELL}> при работе в данном режиме под Windows.

source: It is therefore conventional for a module to use only keys that begin with the module's name (the name of its main package) and a "/" character.
ru_ru: Поэтому для обычного модуля для использования только ключи, которые начинаются с имени модуля (имя его основной пакет) и символ "/".

source: It makes the stream pass each byte as-is without translation.
ru_ru: Это делает поток проходит каждый байт как есть без перевода.

source: It may seem obvious to say, but Perl is useful only when users can easily find it.
ru_ru: Это может показаться очевидным сказать, но Perl полезен только тогда, когда пользователи могут легко найти его.

source: It operates on C<$_> by default, or can be bound to another variable using the C<=~> binding operator (also documented in L<perlop>).
ru_ru: Он работает с C<$_> по умолчанию, или может быть связан с другой переменной с помощью оператора привязки C<=~> (также документированы в L<perlop>).

source: It quickly became a good language for many system management tasks.
ru_ru: Он быстро стал хорошим языком для многих систем управления задачами.

source: It still boasts some of the most powerful regular expressions to be found anywhere, and its support for Unicode text is world-class.
ru_ru: Он по-прежнему может похвастаться одними из самых мощных регулярных выражений, которые можно найти для любого текста, и поддержкой кодировки Unicode мирового класса.

source: It will search the B<q>uestion headings in perlfaq[1-9] and print the entries matching the regular expression.
ru_ru: которое позволяет найти вопрос (B<q>uestion) в FAQ по Perl [1-9] и вывести записи, удовлетворяющие этому выражению.

source: It would be possible to emulate awk's behavior in selecting string versus numeric operations at run time by inspection of the operands, but it would be gross and inefficient.
ru_ru: Можно было бы подражать поведению AWK в выборе строки сравнении числовых операций во время выполнения проверки операнда, но это было бы грубым и неэффективным.

source: It's a good idea to turn them on explicitly for programs that run on behalf of someone else whom you might not necessarily trust, such as CGI programs or any internet servers you might write in Perl.
ru_ru: Это хорошая идея, чтобы включить их явно для программы, которые работают от чужого имени, которым вы не обязательно будете доверять, таких, как программы CGI или любого интернет-серверов, вы можете написать в Perl.

source: It's almost always right, but it can be spoofed.
ru_ru: Это почти всегда верно, но иногда можно впасть в обман (это может быть подделано).

source: It's also convenient when debugging a script that uses C<#!>, and is thus normally found by the shell's $PATH search mechanism.
ru_ru: Это также удобно при отладке скрипта, который использует C<#!>, и, таким образом, обычно находящиеся на в области поиска shell $PATH.

source: It's documented in extravagant detail in L<perlfunc> and L<perlopentut>, but in short:
ru_ru: Это описано в экстравагантных деталях в L<perlfunc> и L<perlopentut> , но в кратце:

source: It's just a mess.
ru_ru: Это просто беспорядок.

source: It's used as the default argument to a number of functions in Perl, and it's set implicitly by certain looping constructs.
ru_ru: Она используется как аргумент по умолчанию для ряда функций в Perl, и устанавливается неявно в определенные циклические конструкции.
